# RYUUSHINNI
# Ryuu-Userbott

from userbot import CMD_HELP
from userbot.events import register
from time import sleep


@register(outgoing=True, pattern='^.heu(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("▒▒▒▒▒▄██████████▄▒▒▒▒▒\n"
                     "▒▒▒▄██████████████▄▒▒▒\n"
                     "▒▒██████████████████▒▒\n"
                     "▒▐███▀▀▀▀▀██▀▀▀▀▀███▌▒\n"
                     "▒███▒▒▌■▐▒▒▒▒▌■▐▒▒███▒\n"
                     "▒▐██▄▒▀▀▀▒▒▒▒▀▀▀▒▄██▌▒\n"
                     "▒▒▀████▒▄▄▒▒▄▄▒████▀▒▒\n"
                     "▒▒▐███▒▒▒▀▒▒▀▒▒▒███▌▒▒\n"
                     "▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒\n"
                     "▒▒▒██▒▒▀▀▀▀▀▀▀▀▒▒██▒▒▒\n"
                     "▒▒▒▐██▄▒▒▒▒▒▒▒▒▄██▌▒▒▒\n"
                     "▒▒▒▒▀████████████▀▒▒\n")
    
    
@register(outgoing=True, pattern='^.hem(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(" ╭━┳━╭━╭━╮╮\n"
                     " ┃┈┈┈┣▅╋▅┫┃\n"
                     " ┃┈┃┈╰━╰━━━━━━╮\n"
                     " ╰┳╯┈┈┈┈┈┈┈┈┈◢▉◣\n"
                     "   ╲┃┈┈┈┈┈┈┈┈┈┈▉▉▉\n"
                     "   ╲┃┈┈┈┈┈┈┈┈┈┈◥▉◤\n"
                     "   ╲┃┈┈┈┈╭━┳━━━━╯\n"
                     "   ╲┣━━━━━━┫\n"
                     "    **MENCURIGAKAN**\n")
    

@register(outgoing=True, pattern='^.wle(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("┈╭━━━━━━━━━━━╮┈\n" 
                     "╭╯┈╭━━╮┈╭━━╮┈╰╮\n" 
                     "┃┈┃┃╭╮┃┈┃╭╮┃┃┈┃\n" 
                     "┃┈┃┻┻┻┛┈┗┻┻┻┃┈┃\n" 
                     " ┃┈┃╭╮┈◢▇◣┈╭╮┃┈┃\n" 
                     "╰┳╯┃╰━━┳┳┳╯┃╰┳╯\n" 
                     "┈┃┈╰━━━┫┃┣━╯┈┃┈\n" 
                     "┈┃┈┈┈┈┈╰━╯┈┈┈┃┈\n")
    
    

@register(outgoing=True, pattern='^.pler(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("░░░░█─────────────█──▀──\n"
                     "░░░░▓█───────▄▄▀▀█──────\n"
                     "░░░░▒░█────▄█▒░░▄░█─────\n"
                     "░░░░░░░▀▄─▄▀▒▀▀▀▄▄▀──DO─\n"
                     "░░░░░░░░░█▒░░░░▄▀───YOU─\n"
                     "▒▒▒░░░░▄▀▒░░░░▄▀───LIKE─\n"
                     "▓▓▓▓▒░█▒░░░░░█▄───WHAT─\n"
                     "█████▀▒░░░░░█░▀▄───YOU──\n"
                     "█████▒▒░░░▒█░░░▀▄─SEE?──\n"
                     "███▓▓▒▒▒▀▀▀█▄░░░░█──────\n"
                     "▓██▓▒▒▒▒▒▒▒▒▒█░░░░█─────\n"
                     "▓▓█▓▒▒▒▒▒▒▓▒▒█░░░░░█────\n"
                     "░▒▒▀▀▄▄▄▄█▄▄▀░░░░░░░█─\n")
    
    
@register(outgoing=True, pattern='^.ahh(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("ahhh ahhh ahhh")
    await typew.edit("🥵")
    sleep(0.5)
    await typew.edit("⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡠⠢⠏⣉⣉⠣⢦⡀⠄⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣐⢪⠅⣱⣟⢛⢧⠄⣷⠄⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⠠⣬⣀⣢⣕⡽⢯⣩⣳⣷⠧⡆⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⢠⡭⡾⣆⢿⡙⢟⢻⣿⡿⡹⣶⠅⠄⠄⠄ \n"
                     "⠄⠄⠄⠄⠄⠄⠄⣔⠄⡗⢫⠘⠷⠾⠿⠟⠙⣡⢢⢖⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⢫⠺⠁⡹⢸⣿⣿⣿⡟⠲⣦⣌⢄⡇⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⢀⡈⢛⠨⠥⡄⣿⣿⣿⣧⢯⡻⡇⠨⣁⠄⠄\n"
                     "⠄⠄⠄⠄⠄⢠⡤⢠⣶⣿⣿⣿⣿⣿⣿⣿⣷⢗⠵⡐⡣⡄⠄\n"
                     "⠄⠄⠄⠄⠄⠸⢡⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣷⡄⢶⡇⡇⠄\n"
                     "⠄⠄⠄⠄⠄⣠⣿⣿⣿⣿⣿⠟⢸⣿⣿⣿⡟⡻⣿⠘⠧⡇⠄\n"
                     "⠄⠄⠄⠄⠄⢳⣿⣿⣿⡿⣫⣾⣜⢿⣿⣿⣷⣶⡿⢀⠗⡇⠄\n"
                     "⠄⠄⠄⠄⠄⣦⡝⣭⣵⣾⣿⣿⣿⣦⣍⣛⣛⣫⠡⣼⢾⣿⠄\n"
                     "⠄⠄⠄⠄⢰⣿⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄⠨⣿⡟⠄\n"
                     "⠄⠄⠄⢀⣿⡿⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢆⣶⣿⠇⠄\n"
                     "⠄⠄⠄⢸⣿⣷⠎⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⣷⣻⡆⠄\n"
                     "⠄⠄⢀⣿⣿⠏⢸⡟⢿⣿⣿⣸⣿⣿⣿⣿⢏⣾⣿⣿⣏⣷⠄\n"
                     "⠄⠄⣸⣿⠏⢀⣼⣿⣎⡻⢿⣿⣿⣿⠿⣣⣾⣿⣿⣿⣿⣽⠄\n"
                     "⠄⠄⣿⡿⣰⣿⣿⣿⣿⣿ AHHH ⣰⣿⣿⣿⣿⣿⣿⣿\n")
    
    
    CMD_HELP.update({
    "animasi8":
    "`.Heu` ; `.hem` ; `.wle` ; `.pler`; `.ahh\
    \nUsage: liat aja."
})
